{
  "irVersion": "1.0",
  "project": "agent-protocols",
  "repository": "https://github.com/aistandardsio/agent-protocols",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.5.0",
      "date": "2026-05-24",
      "highlights": [
        { "description": "Cross-protocol bridging: New `bridge/` package enables interoperability between ID-JAG, AIMS, and AAuth" },
        { "description": "Observability integration: New `bridge/observe/` package with distributed tracing, metrics, and logging via OmniObserve" },
        { "description": "Protocol-bridge demo: Working example demonstrating multi-protocol authentication" }
      ],
      "added": [
        { "description": "`bridge/` package with canonical identity and cross-protocol converters", "commit": "23ee068" },
        { "description": "`bridge.Identity` canonical representation for protocol-agnostic code", "commit": "23ee068" },
        { "description": "`bridge.DetectProtocol()` for automatic protocol detection from JWT typ header", "commit": "2d6a7c5" },
        { "description": "`bridge.Parse()` for unified token parsing across protocols", "commit": "2d6a7c5" },
        { "description": "`bridge.MultiProtocolMiddleware()` HTTP handler accepting any protocol", "commit": "373cef4" },
        { "description": "`bridge/observe/` package for OmniObserve integration", "commit": "ed19b4f" },
        { "description": "`observe.Middleware()` with distributed tracing, metrics, and logging", "commit": "ed19b4f" },
        { "description": "`observe.DelegationTracker` for delegation chain tracing", "commit": "ed19b4f" },
        { "description": "`demos/protocol-bridge/` cross-protocol demo application", "commit": "a3fd63c" }
      ],
      "documentation": [
        { "description": "Bridge package documentation", "commit": "c077900" },
        { "description": "OAuth to Agent migration guide", "commit": "48c9c96" },
        { "description": "Hybrid authentication guide", "commit": "48c9c96" },
        { "description": "Updated roadmap with Phase 7 and 8 progress", "commit": "e6d6db0" }
      ],
      "tests": [
        { "description": "Comprehensive bridge package tests", "commit": "4eaaa30" },
        { "description": "Protocol-bridge demo integration test", "commit": "f84073e" }
      ],
      "dependencies": [
        { "description": "`github.com/plexusone/omniobserve` v0.10.0", "commit": "ed19b4f" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-05-24",
      "highlights": [
        { "description": "AIMS: Token parsing and verification with WITVerifier and WPTVerifier" },
        { "description": "AAuth: JWT typ header validation and context-aware verification methods" },
        { "description": "ID-JAG: IETF-compliant token types and IdP authorization server" }
      ],
      "added": [
        { "description": "AIMS `ParseWIT` and `ParseWPT` functions for token inspection without verification", "commit": "9fc9e1a" },
        { "description": "AIMS `WITVerifier` for cryptographic WIT signature verification with issuer/audience validation", "commit": "9fc9e1a" },
        { "description": "AIMS `WPTVerifier` for WPT verification including HTTP request binding checks", "commit": "9fc9e1a" },
        { "description": "AIMS `TokenTypeWIT` and `TokenTypeWPT` constants per WIMSE specification", "commit": "9fc9e1a" },
        { "description": "AAuth `validateTokenType` function for JWT typ header validation in token parsers", "commit": "20070a4" },
        { "description": "ID-JAG IETF-compliant token type constants and JWT header values", "commit": "a469aad" },
        { "description": "ID-JAG required IETF claims (`client_id`, `jti`) in Assertion struct", "commit": "bbd2b31" },
        { "description": "ID-JAG `IdPAuthServer` for OAuth token exchange at identity providers", "commit": "c3a32c9" },
        { "description": "ID-JAG token type acceptance in Resource authorization server", "commit": "53ade96" },
        { "description": "Integration test script (`scripts/integration-test.sh`) for running all examples", "commit": "7c8f4df" }
      ],
      "changed": [
        { "description": "**BREAKING**: AAuth `ResourceServer.VerifyAgentToken` and `VerifyAuthToken` now require `context.Context` parameter", "commit": "a838560" },
        { "description": "**BREAKING**: AAuth `AuthServer.validateExchangeRequest` now accepts `context.Context` for proper cancellation", "commit": "a838560" },
        { "description": "AIMS `signingMethodForKey` properly detects RSA, ECDSA (P-256/384/521), and Ed25519 keys", "commit": "9fc9e1a" },
        { "description": "AIMS WIT and WPT signing now sets `typ` header per WIMSE specification", "commit": "9fc9e1a" }
      ],
      "fixed": [
        { "description": "SharkAuth DPoP `parseJWKPublicKey` now properly parses RSA, EC, and OKP keys using aauth.JWK", "commit": "1187ad5" },
        { "description": "AAuth request body size limit (1MB) prevents memory exhaustion in AuthServer", "commit": "a838560" }
      ],
      "documentation": [
        { "description": "AIMS package documentation for parsing and verification APIs", "commit": "0ebd848" },
        { "description": "AAuth package documentation for context-aware verification methods", "commit": "7a92300" },
        { "description": "Project roadmap documenting release history and future phases", "commit": "d520cfc" },
        { "description": "README Development section with test, lint, and integration commands", "commit": "4c17112" },
        { "description": "ID-JAG datasheet updated for IETF compliance", "commit": "0789d1e" },
        { "description": "ID-JAG delegation example updated for IETF-compliant flow", "commit": "9da3c03" }
      ],
      "tests": [
        { "description": "AIMS parsing and verification tests for WIT and WPT", "commit": "f46f38b" },
        { "description": "AAuth typ header validation tests for all token types", "commit": "575800b" },
        { "description": "SharkAuth DPoP proof verification tests for EC and RSA keys", "commit": "a4c4c62" }
      ],
      "refactor": [
        { "description": "Extract shared CSS theme from HTML datasheets", "commit": "a4e4c68" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-05-11",
      "commit": "d9fc824",
      "highlights": [
        { "description": "SharkAuth adapter: Agent delegation with may_act_grants and DPoP proof-of-possession" },
        { "description": "Ory adapter: Fosite custom OAuth handlers and Hydra client for production integration" }
      ],
      "added": [
        { "description": "SharkAuth adapter (`adapters/sharkauth/`) for agent delegation infrastructure", "commit": "1fa75e7" },
        { "description": "RFC 8693 Token Exchange client for SharkAuth", "commit": "1fa75e7" },
        { "description": "DPoP proof-of-possession binding per RFC 9449", "commit": "1fa75e7" },
        { "description": "`may_act_grants` API for structured delegation with cascade revocation", "commit": "1fa75e7" },
        { "description": "SharkAuth example: AAuth agent integration with delegation grants", "commit": "1fa75e7" },
        { "description": "Ory adapter (`adapters/ory/`) for Fosite and Hydra integration", "commit": "4512cad" },
        { "description": "Custom Fosite OAuth handlers for ID-JAG assertions and AAuth tokens", "commit": "4512cad" },
        { "description": "Token storage interface with in-memory implementation for Fosite", "commit": "4512cad" },
        { "description": "Hydra client for public and admin APIs with token exchange support", "commit": "4512cad" },
        { "description": "JWT Bearer grant support (RFC 7523) for Hydra", "commit": "4512cad" },
        { "description": "Token introspection with actor claim support for delegation", "commit": "4512cad" },
        { "description": "Ory example: ID-JAG assertion exchange with mock Hydra server", "commit": "4512cad" }
      ],
      "documentation": [
        { "description": "Update three-tier architecture plan with adapter completion status", "commit": "d9fc824" }
      ],
      "tests": [
        { "description": "Unit tests for SharkAuth client, delegation, and DPoP", "commit": "1fa75e7" },
        { "description": "Unit tests for Ory Fosite handlers and Hydra client", "commit": "4512cad" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-05-11",
      "commit": "0f644d7",
      "highlights": [
        { "description": "AAuth protocol: HTTP message signatures (RFC 9421) with token exchange for AI agent authentication" },
        { "description": "Zitadel adapter: Production integration for ID-JAG, AIMS, and AAuth with Zitadel OIDC infrastructure" },
        { "description": "Unified navigation: AIStandards.io navbar integration across documentation site" }
      ],
      "added": [
        { "description": "AAuth library (`aauth/`) implementing draft-hardt-oauth-aauth-protocol", "commit": "38fd1e1" },
        { "description": "HTTP message signatures (RFC 9421) for request authentication", "commit": "8f595c6" },
        { "description": "AAuth token types: `aa-agent+jwt` and `aa-auth+jwt`", "commit": "238c71f" },
        { "description": "Agent client with automatic request signing transport", "commit": "18dbff8" },
        { "description": "Resource server middleware for AAuth token validation", "commit": "a1921b1" },
        { "description": "Auth server with token exchange and JWKS endpoints", "commit": "e80f1d2" },
        { "description": "Discovery client for AAuth metadata retrieval", "commit": "29f9e26" },
        { "description": "AAuth examples: simple agent, delegation, token exchange", "commit": "d5f7d1b" },
        { "description": "AAuth delegation example with Person Server flow", "commit": "e73ae2e" },
        { "description": "PIDL definitions for AAuth protocol flows", "commit": "303b4b8" },
        { "description": "Zitadel adapter (`adapters/zitadel/`) for production OIDC integration", "commit": "46ceed0" },
        { "description": "RFC 8693 token exchange client for ID-JAG assertions", "commit": "4b48d73" },
        { "description": "RFC 7523 JWT profile grants with `oauth2.TokenSource` interface", "commit": "992a34f" },
        { "description": "Token verification using Zitadel JWKS for all protocols", "commit": "d889c03" },
        { "description": "HTTP middleware for Zitadel token validation", "commit": "c43ddf3" },
        { "description": "Zitadel example applications for each protocol", "commit": "69015d1" },
        { "description": "Multi-protocol integration demo application", "commit": "a63258e" }
      ],
      "changed": [
        { "description": "Rename module from `github.com/grokify/agent-protocols` to `github.com/aistandardsio/agent-protocols`", "commit": "32340ad" },
        { "description": "Documentation site uses unified AIStandards.io navigation bar", "commit": "77a30bf" }
      ],
      "fixed": [
        { "description": "Use aistandards.io URLs to avoid mixed content blocking on GitHub Pages", "commit": "0f644d7" },
        { "description": "Match aistandards.io navbar styling with three-segment title", "commit": "8124e1d" }
      ],
      "documentation": [
        { "description": "AAuth protocol documentation: overview, getting started, examples, API reference", "commit": "0cd708a" },
        { "description": "Zitadel adapter documentation: overview, getting started, examples, API reference", "commit": "6bb8043" },
        { "description": "v0.2.0 release notes", "commit": "3983875" },
        { "description": "Updated navigation for adapters section", "commit": "76d81b5" }
      ],
      "tests": [
        { "description": "Unit tests for Zitadel adapter components", "commit": "75b9b4e" }
      ],
      "dependencies": [
        { "description": "Add `golang.org/x/oauth2` for TokenSource interface", "commit": "c4fb160" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-04-19",
      "highlights": [
        { "description": "Initial release with ID-JAG and AIMS protocol implementations for AI agent authentication" },
        { "description": "ID-JAG: OAuth 2.0 token exchange with JWT assertions and human-to-agent delegation support" },
        { "description": "AIMS: SPIFFE-based workload identity with WIT/WPT authentication per WIMSE specification" }
      ],
      "added": [
        { "description": "ID-JAG library (`idjag/`) implementing draft-ietf-oauth-identity-assertion-authz-grant", "commit": "25c20f6" },
        { "description": "JWT assertion creation and signing with RS256/ES256 support", "commit": "25c20f6" },
        { "description": "Token exchange client for RFC 8693 token exchange flow", "commit": "25c20f6" },
        { "description": "JWT Bearer client for RFC 7523 JWT bearer grant", "commit": "25c20f6" },
        { "description": "Authorization server with JWKS endpoint for assertion verification", "commit": "25c20f6" },
        { "description": "Resource server middleware for Bearer token validation", "commit": "25c20f6" },
        { "description": "Actor claim (`act`) support for human-to-agent delegation chains", "commit": "25c20f6" },
        { "description": "Static key and JWKS-based JWT verifiers", "commit": "25c20f6" },
        { "description": "AIMS library (`aims/`) implementing draft-klrc-aiagent-auth-00", "commit": "f7165d3" },
        { "description": "SPIFFE ID parsing and validation with trust domain support", "commit": "f7165d3" },
        { "description": "Nine-layer AIMS architecture model", "commit": "f7165d3" },
        { "description": "AgentIdentity type combining SPIFFE ID, credentials, and attestation", "commit": "f7165d3" },
        { "description": "Workload Identity Token (WIT) per draft-ietf-wimse-s2s-protocol", "commit": "5479db2" },
        { "description": "WIMSE Proof Token (WPT) with HTTP request binding", "commit": "5479db2" },
        { "description": "X.509 SVID and JWT-SVID credential types", "commit": "f7165d3" },
        { "description": "Attestation types: TPM, SGX, SEV-SNP, TDX, Kubernetes, AWS, GCP, Azure, GitHub", "commit": "f7165d3" },
        { "description": "ID-JAG examples: simple agent flow and human-to-agent delegation", "commit": "e8a8ac8" },
        { "description": "AIMS examples: simple WIT/WPT authentication and mTLS with X.509 SVID", "commit": "9fc6faa" },
        { "description": "PIDL definitions for ID-JAG flows (simple, delegation, token exchange)", "commit": "445dd49" },
        { "description": "PIDL definitions for AIMS flows (WIT issuance, WPT authentication)", "commit": "b03a5f1" }
      ],
      "fixed": [
        { "description": "Resolve gosec lint errors (G101, G112, G117, G120, G704)", "commit": "d6960a4" }
      ],
      "documentation": [
        { "description": "MkDocs documentation site with Material theme", "commit": "6b769c0" },
        { "description": "Protocol overview with sequence diagrams for ID-JAG", "commit": "6b769c0" },
        { "description": "Getting started guides for both ID-JAG and AIMS", "commit": "6b769c0" },
        { "description": "API reference documentation for both packages", "commit": "c671ab4" },
        { "description": "PIDL-generated Mermaid sequence diagrams", "commit": "16376ad" },
        { "description": "Multi-protocol landing page with comparison table", "commit": "89b6813" },
        { "description": "AIMS overview with 9-layer architecture diagram", "commit": "016d755" }
      ],
      "tests": [
        { "description": "Comprehensive unit tests for AIMS package (SPIFFE, WIT, WPT, credentials, attestation)", "commit": "cd820eb" }
      ],
      "build": [
        { "description": "GitHub Actions CI workflows for build, lint, and SAST", "commit": "81e1c3f" },
        { "description": "golangci-lint configuration", "commit": "2c89238" }
      ],
      "changed": [
        { "description": "Restructure repository for multiple protocols (idjag/, aims/)", "commit": "8c2ee5a" }
      ]
    }
  ]
}
